{
  "post_type": "News",
  "date": "2021-12-09T04:22",
  "title": "Moving Forward Post Election",
  "lede": "As the year comes to a close, your San Juan Island Fire and Rescue (SJIF&R) responders and I wished to take a moment to reflect where we are today and what the future holds.",
  "featured_image": {
    "source": "chief-photo-1-2-.jpg",
    "width": 441,
    "height": 588
  },
  "body": "There are three points to address that are timely and germane in terms of response and care in our community, the voices of the majority of the voters, agreement issues, and deployment modeling for SJIF&R.\n\nLet me take a moment to be clear about the November 2021 election. We have heard loud and clear that the community and voters want change in delivery of ambulance services. While the levy didn’t garner the needed super-majority of 60%, a majority of 56% of our district residents DID support the levy. The proposed levy was not whether to consolidate ambulance transport by San Juan Island EMS (SJIEMS) into the Fire District, but the levy proposed a funding mechanism needed to implement consolidated emergency response, approved by the elected members of both district boards. \n\nThe majority vote supported the concept that was proposed and initially brought to the Fire District by the Public Hospital District (PHD), and evaluated by an appointed Citizen’s Advisory Group. As a result, plans were developed, supported and approved by both the PHD and Fire District’s elected commissioners, and the proposed funding mechanism was brought to the voters. \n\nTo say the vote indicates a lack of support for emergency services consolidation on our islands is a complete misrepresentation. It is a travesty that the PHD has chosen to break the joint Memorandum of Understanding (MOU) to consolidate emergency service. As a reminder, it was the PHD who wrote the MOU and brought it to the Fire District for support. Both boards approved moving forward with consolidation and implementing the MOU to consolidate. \n\nThe MOU that was presented to the Fire District stated “that an EMS Levy will be brought to the voters of between $0.45 and $0.50” or the PHD wouldn’t support the measure. This statement handcuffed us from asking for anything otherwise; moreover, the plan that was developed by the Fire District for combined services showed that ambulance transport could be provided within a combined system for between $0.38 and $0.42 and give better coverage which would have included full staffing with five personnel per 24-hour shift including paramedics responding and coordinating emergency calls from a single, central station. Currently, SJEMS paramedics are allowed to serve on call and respond to emergency calls from their homes. \n\nThe SJIEMS goal of a 20-minute response time, with on call paramedics allowed to have seven minutes to go enroute to an emergency, doesn’t serve the needs of our community. The 20 minutes might be argued to be acceptable for an entire District, including other islands, if SJIEMS met the high 90 percentile response rate for ambulance transport – which it unfortunately does not. SJIF&R crews are expected to go enroute within 90 seconds for all incident types. \n\nIt stands to reason that the further the incident is from a staffed station the longer it takes to arrive; therefore, we are exploring a staffing model that will place responders in both Friday Harbor, 24-hours a day, and Roche Harbor, day staffing. Since we have the majority of responders on San Juan Island, both Firefighters and EMTs, this will provide better coverage from an emergency service, all-hazards perspective for emergency medical calls and for fire/rescue calls resulting in better, efficient service to you, our islands’ residents. \n\nThe proposed consolidation and levy provided a much better way to protect our community. If we had stayed the course and what our data and plan demonstrated, we would have asked for that amount in either a lid lift (needing 50% plus one to pass) or an EMS Levy (needing the 60% to pass). There are limited funds within our community to support services; a comprehensive service is better than duplicative government agencies. We must remain vigilant in future elections that facts are checked and sources are validated so we CAN make informed decisions that will affect us for years to come.\n\nThe mission and goal of SJIF&R has always been to protect this community in their time of need. We always have done this, and we always will. Responding as we do in an all-hazard deployment strategy has demonstrated a vast improvement in care and protection of our community. It is our ethical responsibility to do this and it is in our legal jurisdiction to do. Let me be clear - it would be irresponsible and unethical to stop responding on prehospital medical incidents.  To do so would be a failure of ensuring we have the proper resources on scene to handle any emergency and that shouldn’t be acceptable to our community. It doesn’t meet our mission and our commitment as first providers. That is absolutely not going to happen. \n\nThe pandemic showed, and continues to challenge us, that in order to meet the needs of our community we must change from the past and be more dynamic in our service delivery models. Call volumes are increasing across the county and here at home, and SJIF&R will meet that need. When you are in your time of need, we will be there to help you. We have demonstrated the ability to change dynamically, improve service delivery, and increase care while supporting the needs of the career and volunteers that serve you. \n\nAs we approach the new year ask yourself a simple question, who benefits most from proposed actions being taken, or those prevented from being taken. If the answer on who benefits isn’t YOU, our residents and the taxpaying public, it certainly isn’t the best solution.\n\n![Chief Collin's addressing first responders](/assets/images/chief-photo-3.jpg \"Chief Collin's addressing first responders\")\n\nChief Collins' background:  Chief Norvin Collins Chief Collins presents nationally on a variety of leadership and development topics for the International Association of Fire Chiefs' (IAFC) Volunteer and Combination Officers Section (VCOS), State Chief’s Associations, Elected Officials Conferences, and other local and national organizations. Norvin is an Elected Board member for the VCOS and holds positions on the VCOS national conference planning committees, a Planning Section Chief for a regional Type III Incident Management Team, and a member of numerous committees both internal and external to the fire service. Chief Collins holds a B.S. in Fire Administration, a M.S. in Psychology, and EFO credentials through the National Fire Academy. He holds numerous fire and medical operational certifications as well as having published papers and articles on various fire service topics."
}
