{
  "post_type": "Announcement",
  "date": "2021-12-07T13:24",
  "title": "Vehicle Auction: Easy Bid Process for Surplus Vehicle",
  "lede": "San Juan Island Fire and Rescue is offering a surplus vehicle for sale by an easy sealed bid process: 2000 Nissan Xterra 4-door, 4WD SE Sport Utility Vehicle. \nGasoline engine with automatic transmission at 194,464 miles.",
  "featured_image": {
    "source": "img_8182-2-.jpg",
    "width": 2965,
    "height": 1844,
    "alt": "San Juan Island Fire and Rescue's surplus vehicle for sale"
  },
  "body": "VIN: 5N1ED28Y5Y2576012\tMinimum Bid on this vehicle is $2500\n\nBids will be accepted starting today, Monday, December 6, 2021 – and the bid process ends and is closed on bids Sunday, December 19, 2021 at 5:00 PM. No bids will be reviewed until AFTER the bid process is closed. \n\nPlease send an email with your bid to: [sjifiresurplusvehicle@gmail.com](<mailto:sjifiresurplusvehicle@gmail.com?subject=Bid on Nissan Xterra>)\n\nIn the email subject please state: Bid on Nissan Xterra. Please include your name, phone number and your email address and your bid price.  \n\nThe highest bidder will be notified on Monday, December 20, 2021. The sale of the vehicle will be as is, no warranty or any other guarantees. If the highest bidder declines the sale, the next highest bidder will be notified. \n\nSorry, no test drives are allowed due to safety requirements. You may schedule an inspection time where you will be able to start the vehicle and you can have a mechanic come to do an inspection during your scheduled time.\n\nFor questions or to set up a time to see the vehicle please email: [tlean@sjifire.org](mailto:tlean@sjifire.org)\n\n![back view](/assets/images/img_8181-2-.jpg 'back view')\n\n![driver front](/assets/images/img_8179-2-.jpg 'driver front')\n\n![front](/assets/images/img_8178-2-.jpg 'front')\n\n![trunk and extras](/assets/images/img_8177-2-.jpg 'trunk and extras')\n\n![back seat](/assets/images/img_8176-2-.jpg 'back seat')\n\n![front seat](/assets/images/img_8175-2-.jpg 'front seat')"
}
