{
  "post_type": "Announcement",
  "date": "2022-04-14T14:45",
  "title": "Update on Spring Street fire on April 7, 2022 – Joint Release",
  "lede": "San Juan Island Fire and Rescue, Town of Friday Harbor, and San Juan County Sheriff’s Office (SJCSO) are at a point in the investigation and recovery of the recent fire on Spring Street to share fire origin and cause.",
  "body": "On the morning of April 7, 2022, a fire was reported behind some commercial buildings on Spring Street in downtown Friday Harbor. The fire was found to have originated on the deck behind the commercial structure housing Crystal Seas Kayaking and was determined to have been caused by arson.\n\nThe quick response by San Juan Island Fire and Rescue combined with early request for additional fire suppression support from other local departments (Orcas Fire and Rescue and Lopez Fire and EMS) allowed for suppression efforts that limited greater destruction. Fire damaged the building of origin and nearby exposed buildings.\n\nCoordination between the Town of Friday Harbor and SJCSO blocked access to hazard structures and roadways close to the fire. Incident Command assigned initial fire investigation to the Town of Friday Harbor Fire Marshall. The County Fire Marshall arrived to offer investigative support. Due to the magnitude of the fire damage, the regional fire investigation office was contacted. They responded and requested assistance from the Alcohol, Tobacco, Firearms, and Explosives (ATF) National Response Team (NRT). Cause determination was completed by the NRT while interviews were conducted by SJCSO and ATF/NRT. While the origin and cause investigations have been completed, investigation continues by the SJCSO and regional ATF for suspects. SJCSO will share more information as it becomes available.\n\nAs recovery continues, the Town of Friday Harbor will be working with building owners to ensure safe reopening of structures.\n\nThe outpouring of support from local, regional, and national agencies and communities is appreciated by all the responders, business owners, and our community. While this fire was tragic and devastating, it is because of this type of support we will recover and look forward to an even safer future.\n\nPress Release available [here](/assets/media_releases/2022/joint_release_spring_st_fire_april_7_2022.pdf)."
}
