{
  "post_type": "On Scene",
  "date": "2022-04-15T13:30",
  "lede": "San Juan Island Fire & Rescue would like to express gratitude to emergency responders and the wider community in the aftermath of the April 7 fire downtown.",
  "body": "We received a page from 911 dispatch at 3:46 that morning, with the message that flames were visible two blocks from the county courthouse. The on-duty crew had just returned from a medical call, and they were back on the engine within 30 seconds of the page. They discovered fire within two structures and pressuring three other buildings. They requested additional units and received a very robust response from off-duty career and volunteer first responders and support personnel. It was an intense morning for our department and a tremendous blow to local businesses and our historic district, and we feel fortunate that good training and strong, well-coordinated support prevented serious injuries and saved adjacent buildings.\n\nThe team investigating the scene has just announced their conclusion that this fire was an act of arson [[Press Release](https://www.sjifire.org/news/2022-04-14-update-on-spring-street-fire-on-april-7-2022-joint-release/)]. Law enforcement will now follow on with a criminal investigation. At the fire department, we will continue to evaluate every aspect of our response to learn what went well and what can be improved. A complex emergency response in the heart of our town prompts a lot of questions from the public about how and why we do what we do. Educating the community about safety measures and emergency response is an important part of our mission that can help keep everyone safer in times of emergency. We look forward to sharing more about what unfolded during the town fire in the coming weeks and months. In the meantime, we want to acknowledge two big takeaways from the April 7 incident.\n\nFirst, we appreciate all the partners who came together to support us on this fire response and investigation. Every emergency scene requires responders to work as a team, whether it's a small medical response or a commercial fire. We train to a system used by most emergency responders across the nation called [NIMS](https://www.fema.gov/emergency-managers/nims), which allows us to safely and effectively expand or contract the number of resources needed on a scene. NIMS orchestrates command and control across all participating agencies so that everyone can work together seamlessly and efficiently. That training—and the regional relationships we build by participating in pooled-resource programs like the [Washington State Fire Resource Mobilization Plan](https://www.wsp.wa.gov/2022/04/11/state-fire-mobilization-authorized-for-the-spring-street-fire/)—allowed us to coordinate firefighting teams from multiple islands and mainland departments and to communicate with town, state, and federal jurisdictions not just during the fire but throughout the week-long investigation afterward.  \n\n![Lopez & Orcas Islands firefighters on scene](/assets/images/ssfire_lopez.png \"Lopez & Orcas Islands firefighters on scene\")\n\nIt's important to understand that systems, structures, and training are what keep us safe when we step into a burning building. But heart and dedication to community service are the motivators that make first responders jump out of bed to muster, and we see those same qualities in the outpouring of support from islanders. Friday Harbor's hour of need was met with incredible effort and professionalism from emergency services personnel, but also from water and power agencies, ferry crews, and many other team players who didn't hesitate to put their talents and resources to work. Local businesses and individuals have stepped up with generosity to exemplify community-minded leadership. We hope San Juan Island will be able to look back on this moment as proof that we can choose unity over factionalism and lift each other up in the toughest moments. \n\nWe are so proud and honored to be serving this community.\n\n![L31 receiving direction](/assets/images/ssfire_l31.png \"L31 Receiving Direction\")\n\n![Starting Overhaul and Teardown](/assets/images/ssfire_teardown.jpg \"Starting Overhaul and Teardown\")\n\n*Photos provided by Dr. Joshua Corsa, [San Juan County MPD](http://sanjuanmpd.org/)*",
  "featured_image": {
    "source": "ssfire_drone.jpg"
  },
  "title": "Spring St. Fire Thoughts"
}