{
  "post_type": "News",
  "date": "2021-10-19T00:00",
  "title": "Nov 2, 2021 Election FAQs",
  "lede": "Frequently Asked Questions for the San Juan Island Fire & Rescue Emergency Medical Services Levy on the November 2nd, 2021 ballot.",
  "body": "## Frequently Asked Questions: San Juan Island Fire & Rescue\n\n## Emergency Medical Services Levy\n\nOn Tuesday, November 2, 2021, voters in San Juan County Fire District #3, will be asked to approve an Emergency Medical Services levy to fund the long sought-after consolidation of emergency medical service and patient transport into a single agency.\n\n### Why Now?\n\n* More than two and a half years ago, an appointed citizens advisory group strongly recommended the consolidation of emergency response into a single agency.\n* The elected boards of San Juan County Public Hospital District #1 and San Juan County Fire District #3 agreed and have voted to move forward to consolidate emergency medical services, funded through the proposed tax levy.\n* The people and equipment of San Juan Island EMS (SJIEMS) will be combined with the people and equipment of San Juan Island Fire and Rescue (SJIF&R). This creates a single emergency services agency responsible for medical, fire, rescue, and marine response.\n* This proposed levy will fund advanced life support (paramedic) and ambulance transport services, which will be provided by SJIF&R.\n* Funds from this levy will support the equipment, training and personnel required to provide the highest quality of emergency response for our district residents.\n\n### What is the cost of the proposed levy and will consolidation save money?\n\n* The proposed levy is NOT a new tax. This levy will replace the current EMS levy, under the PHD, which will expire in December 2022. This proposed levy will not be collected until January 2023, and we are seeking early approval to ensure a seamless transition.\n* The proposed levy is for six years beginning in 2023 and is a general tax on taxable property in the district in an amount up to $0.50 (cents) per $1000 of true and fair assessed valuation. This is the same amount SJIPHD#1 voters approved in 2016 and expires December 31, 2022 for EMS services. SJIPHD#1has committed to not renew for continuity of services beginning in 2023.\n* By consolidating, the need for a Public Hospital District’s EMS levy will end. The total cost being paid through property tax levies for comprehensive emergency services will be approximately $0.94 (cents) per $1000, beginning in 2023, based on current assessed valuation. \n* Currently, SJIF&R and SJIEMS provide emergency medical response, while SJIEMS is the sole ground provider of medical transport (ambulances). Both agencies have existing property tax levies needed to provide funding to pay for response, equipment, training and personnel. The combined will fall under one agency, SJIF&R, with anticipated synergy of scale and resource savings.\n\n### Are consolidated emergency services efficient?\n\nThe combined emergency response model has been the approved national best practices method of providing emergency response since 1975. This model, where fire departments use cross-trained/multi-role firefighters for EMS first response and ambulance transport has many unique and distinct advantages over other models, including:\n\n* Continuity of patient care between first responders and ambulance personnel who are part of the same organization\n* Unity of Command\n* Continuity of medical training and use of medical equipment\n* Continuity of Standardized Operating Procedures\n* Continuity of Medical Direction and of administration\n* Ability to deliver medical care while performing specialized rescue in such cases as auto\n  extrication, marine rescue, high-angle rescue, collapse rescue environments, and\n  hazardous material events\n* There is also economy of scale savings when using firefighters in a cross-trained/multi-\n  role EMS function\n* Elimination of duplicate functions such as administration, training, support functions - More efficient use of limited personnel resources in a smaller community with the\n  reduction of duplicity\n* The emergency response advantage to a fire-based EMS model is that firefighters are trained in multiple disciplines. Besides being trained to handle fires and medical emergencies, firefighters mitigate hazardous material events, perform marine response, perform technical and complicated rescues, and perform fire prevention and education services.\n* As the residents of our islands’ communities age, the long-term ability to train, maintain and sustain paid and volunteer emergency responders has become a significant challenge throughout the San Juan Islands. Consolidation provides continuity of quality, professional and compassionate care, and is consistent with the other agencies in the San Juan County (Orcas and Lopez Fire Districts), and throughout our region, state and the nation.\n\n[San Juan Fire EMS Levy 2021 FAQ.pdf](/assets/docs/san-juan-fire-ems-levy-2021-faq.pdf)"
}
