{
  "post_type": "News",
  "date": "2022-01-21T08:44",
  "title": "Partnerships",
  "lede": "In the 17th Century, English poet John Donne wrote a famous phrase stating that, “No man is an island.” While we live in the San Juan Islands, it is always important to know that no one is an island and we are not alone.",
  "featured_image": {
    "source": "uscg_training.jpg"
  },
  "body": "San Juan Island Fire and Rescue (SJIF&R) is one part of the critical emergency services system serving you and all our islands’ residents. SJIF&R works and trains with a number of emergency services agencies – federal, state and local. Our ability to train together ensures that we are ready to respond with all available resources to meet the needs of our residents throughout our district, as well as being ready to assist our neighbors and visitors throughout the San Juan Islands.  \n\nOne of our important partner agencies ensuring the safety of islanders throughout our waters is the U.S. Coast Guard. This past Sunday morning, an SJIF&R marine crew accomplished an assessment of our district’s outer islands and San Juan Channel following Saturday’s tsunami advisory and surge. At the completion of the assessment, your SJIF&R marine crew linked up with a USCG 45-foot response boat from Station Bellingham in San Juan Channel to participate in two-boat training. Through mutual training opportunities we maintain our response proficiency, develop new skills and hone communication capabilities required to respond to all emergencies.  \n\n![2-boat drills with USCG](/assets/images/uscg_training2.jpg \"2-boat drills with USCG\"){.large_img  }\n\nCurrently, SJIF&R is conducting a fire academy for new recruits. This academy is not an island either – Orcas Island Fire and Rescue and Lopez Island Fire and EMS are conducting concurrent fire academies. Rather than duplicating required training evolutions, SJIF&R has partnered with our neighboring islands’ fire, rescue and EMS services to share resources and develop closer response capabilities between our islands. Orcas and Lopez recruits do some of this training on-line with the in-person SJIF&R class, but will do specific skill work jointly in-person, including required live-fire training.\n\n![Recruit Academy Classroom Training](/assets/images/fire_training_class.jpg \"Recruit Academy Classroom Training\"){.large_img  }\n\nSJIF&R continues to utilize emergency services partners, share resources and work together to provide the highest quality, professional and compassionate care for our residents. It is our mission and our passion to serve you."
}
