{
  "post_type": "News",
  "date": "2022-01-13T22:14",
  "title": "129,158 Minutes",
  "lede": "129,158 is how many minutes SJIF&R responders have been on active calls in the past year.  43 of your island neighbors contributed to that total, answering your requests for assistance 1,016 times.",
  "featured_image": {
    "source": "widget-01-13-22.jpeg",
    "width": 600,
    "height": 1153
  },
  "body": "12 more served the community by leading public education, filling air bottles on fire scenes, maintaining critical life safety equipment, and much more.\n\nBy collecting and analyzing data—whether from emergency calls, internal trainings, or public education events—we can hold ourselves accountable for providing the highest quality of professional emergency services. Data shows us where we can be faster or more cost-effective. It can show what is working well, what isn’t, what is changing over time, and how effective intentional changes have been in meeting specific goals. \n\nWe’ve always collected data about calls—when they start, call types, who showed up, etc.—and that information has led us to make some significant changes throughout the department. Analyzing data moved SJIF&R to a 24/7 response model and led us to adjust marine assets to speed up deployment by more than 50%.  Following the data helps inform decisions to improve services and do so within our budget. An example is the developing plan for additional on-call responders to deploy from Roche Harbor during the summer months.\n\nToday, we’re making available a set of statistics on our website that can help you better understand what SJIF&R is doing for our community.\n\nI want to call attention to two notable metrics:\n\n* **Reaction Time:** This is the time from when dispatch tells us they received a 911 call to when responders are dressed in the appropriate equipment, the vehicle has been inspected with a full walk-around, all responders are buckled in their seats, and the vehicle is moving forward.  This is the real time of departure, which starts the clock on another stat we’re tracking: travel time to different parts of the island. \n* **Responder Time on Calls:** This is the total amount of time your responders have spent on active calls in their community in the past 30 days.  Some scenes can get complex with responders and apparatus coming and going, and this number tracks that activity down to the level of the individual responder.  It doesn’t include return travel to the station, clean-up time, equipment maintenance time, or training hours. \n\nIt’s important to understand a few key points regarding this data:\n\n* A call, or incident, is anytime dispatch receives a 911 call that is in our district or an assistance request from beyond our district.\n* These numbers represent the last 30 days of calls. A call is added to this data set as soon as it is completed and paperwork is submitted. We also display the number of calls in the past 365 days.\n* This data is recomputed every morning and comes directly from [ESO](https://www.eso.com/), our incident and medical reporting software. Personal information is never exported into the data set.\n* It’s important to state that this data is provided in good faith and as-is, as defined in the [disclaimer](/disclaimer/).\n\nWe are proud of these numbers, but data is not the be-all and end-all.  It is an important tool, but just one of a handful we use to see how we’re doing and where we can improve. Your [thoughts and comments](/contact/) are always welcome.\n\n- - -\n\nIf you want to dive into the data, the stats file—generated every 24 hours—is available [here](https://github.com/sjifire/website/blob/main/src/_data/stats.json), and the computer code that generates it is [here](https://github.com/sjifire/website/blob/main/bin/eso_stats_scrapper.js)."
}
