{
  "post_type": "Fact Check",
  "date": "2022-01-18T15:34",
  "title": "We Are an EMS Agency",
  "lede": "Emergency medical services (EMS) is a component of the emergency service system. As a system, none of these component services stand alone. They must be fully linked to operate effectively and efficiently. SJIF&R is the largest EMS agency in the district, and one of six in the county.",
  "featured_image": {
    "source": "ems-skills.png",
    "width": 600,
    "height": 764
  },
  "body": "This is not anything new; SJIF&R has provided personnel—staff, volunteers, & instructors—as well as trauma, rescue, and marine medical services to the district and county for 30 years. \n\nAs we prepared to proceed with the approved consolidation of EMS services by SJIF&R and SJIPHD#1, in  2019, we received an EMS aid license from the state. SJIF&R already has eight registered aid vehicles in operation, providing 24/7 EMS response to the district and region. \n\nThere is no threat that EMS will not be provided to our district residents. If needed for any reason, SJIF&R is positioned to expand emergency response to include transport and advanced life support (ALS) services. The San Juan County Medical Program Director overseeing EMS agencies in the county is fully supportive. \n\nSJIF&R is wholly committed to providing swift and competent emergency medical responses in our district, and when needed, in neighboring districts that call for mutual aid.  \n\nNo levy or ballot measure can destroy or dismantle emergency medical services on San Juan Island. EMS is a robust, cooperative, essential system and it's here to stay. \n\n## FACTS:\n\n* There are 6 EMS agencies in the County, SJIF&R being 1 of 2 which respond in this district.\n* Medical Program Directors, [past](https://www.facebook.com/SJIFire/posts/4454762484635174?comment_id=4457600614351361) and [present](https://sanjuanupdate.com/dr-joshua-corsa-for-fire-district-ems-levy/), believe a combined response model is the best for patients, outcomes, and volunteers.  \n* Fire/ Rescue is a licensed Emergency Medical Services Agency (#61002894) providing pre-hospital care with the most certified EMTs (18) and instructors/evaluators (8) in the district. (numbers as of Jan. 2022)\n* SJIF&R's current aid license does not include advanced life support nor transport licenses, but it can be quickly upgraded by the state in case of community need.  \n* In 2021, 63% of 911 calls were medical & rescue related.\n* Only Fire Districts or Regional Fire Authorities can provide all-hazard emergency services.  Public Hospital Districts, by state law, can only provide EMS and transport services (see [RCW 70.44.060](https://app.leg.wa.gov/rcw/default.aspx?cite=70.44.060)).  Thus, by law, a consolidated agency can only be run under the fire district.\n* SJIF&R's current leaders have over 83 years of EMS expertise as EMTs and Paramedics; as EMS instructors for large regional systems; as instructors at the National Fire Academy and for FEMA; and as directors and chiefs overseeing EMS departments ranging from small communities like ours to large metro districts.  They have a century of governance experience managing emergency services organizations. See [Governance page](/about/governance) for details."
}
