{
  "post_type": "News",
  "date": "2024-04-04T16:42",
  "title": "Greetings from your newly appointed Fire Chief",
  "body": "[](<>)Meeting this mission takes a careful balance of bottom-up and top-down organizational harmony in concert with community will. It takes attentive and proactive leadership. It takes effective administration and management. It takes dedicated staff and volunteers. And it takes community support and trusting relationships. I take responsibility in fostering this harmony throughout all these facets.\n\nMy first order of business was to immediately address an unsustainable budget which is partly due to exceptional inflationary impacts compounded with stagnant revenues from a dwindling tax millage (current collection is $0.34 per thousand). This resulted in ordering an immediate reduction in 24/7 emergency responder staffing coverages and omitting the Assistant Chief position. Other immediate cost reductions have resulted in reducing non-essential emergency medical services responses, reducing availability to respond out of district in our fire boat, pursuing more favorable existing contracts and agreements, reducing certain budgetary line items, and ensuring staff efficiencies. To continue in this positive direction, The district's budget will require a commitment to acute monitoring in the months and years ahead.\n\nThe second order of business has been to foster relationships both locally and regionally. From ongoing inter-agency collaborations and agreements, to meeting with local community groups and organizations, there are concerted efforts to genuinely find common ground and work toward effective outcomes for all parties involved. I cannot overemphasize that establishing and maintaining relationships is necessary in effectively meeting our mission. It truly takes a village to support a functionally vibrant Fire Department, particularly in a remote community.\n\nAnother immediate priority is revitalizing the volunteer spirit and awakening our outer stations. It takes a well-trained, distributed, and equipped network to effectively respond to fires and other complex emergencies. As a community, everyone can support our Fire Department volunteers by recognizing and supporting the effort and dedication they put into their readiness and willingness to protect life and property. Our volunteers carry pagers and radios to be sure not to miss the big call where they can make a positive difference in all of our lives. If you know a volunteer firefighter, be sure to remind them how much you appreciate them. Also, if you are a family member or an employer of a volunteer fire fighter, please accept my sincerest gratitude in your support of their commitment to community and service.\n\nI look forward to addressing the current challenges and embracing the future opportunities that lie ahead. This job is unique, requires a firm, approach balanced with empathy and flexibility, and should always carry a bit of levity-which I try to keep in abundance.Thank you to those who have been vocal and assertive in your support of my taking on this position. I would not have stepped in without your support, and I hope I will live up to your expectations.\n\nMore to come soon,\n\nChief Monin",
  "lede": "During the months leading up to my appointment and in the weeks following, I have been immersed in ensuring that your Fire Department is ready and able to stick to deliver its mission; \"To Protect Life and Property\". Now, as your Chief, this mission is my guiding directive while working under delegation of the Board of Fire Commissioners.",
  "featured_image": {
    "source": "chief_monin_snow.png",
    "width": 720,
    "height": 960
  }
}