{
  "post_type": "Department Highlight",
  "date": "2025-07-13T00:00",
  "lede": "**After Action Report**\n\n**San Juan County Interagency Wildland Team \nFire Simulation Exercise\nSunday, July 13, 2025**\n\nThank you to all who participated in our 2025 exercise - another successful test of the system.",
  "title": "After Action Report",
  "body": "Many folks were involved in supporting this effort, mirroring a real response to a wildland fire on one of the islands in the county. Ironically, many folks involved participated in a similar (real) event just days prior on Orcas, with a very successful deployment of county team members.\n\nThank you all for your participation and support, this is a cooperative effort which relies on us all.\n\n* WA State Parks\n* US Fish and Wildlife\n* SJC Dispatch\n* NW Region WA DNR \n* San Juan Island Fire and Rescue\n* SJC Sheriff’s Office\n* Lopez Island Fire and EMS\n\n**Our Objective:** \n\nExercise the operational readiness of timing and logistics to get one squad of firefighters from a main island to an outer island; assess any needs, issues, problems with communication, transport, safety, readiness, equipment, etc. \n\nSecondly, strengthen squad performance - readiness, teamwork, communication, firefighting knowledge, skills, and abilities, along with developing squad boss trainee leadership skills.\n\n**The Plan (Simulation):**\n\nAt 1500 hours, boater dials 911 advising of:\n\n> *\"Driftwood on fire on Turn Island, off the beach on the west side of the island, appears to be moving into the trees*.”\n\nFirst arriving units find large wildfire from beach well into trees covering large area.\n\n**Response:**\n\n* A call was placed to 911 with the above information. The call receiver took the necessary details and response initiated per established multi-agency agreements with NW Region WA DNR for unprotected lands.\n* Contact was made immediately with WA DNR Dispatch by SJC Dispatch, and incident dispatched to SJIFR as “*wildland response to unprotected island, Turn Island”*.\n* Contact was initiated between SJIFR duty chief (Chief 31) and WA DNR dispatch and duty officer. Chief 31 gave size-up, established *Turn Command*, and directed SJIFR responders to muster at Fireboat 31 ready room’. *Command* requested a squad of firefighters from Lopez Fire-EMS be dispatched, and moved operations to Tac 3. ICP was established at Turn Point across from the incident location on Turn Island.\n* According to squad leaders and members from both agencies - spool up, muster, and transport all went largely seamlessly.\n* *Command* assigned *Operations* (I. Newell) to the first arriving SJIFR squad leader, and established two divisions *Alpha* (San Juan) and *Bravo* (Lopez), each with a leader. San Juan squad initiated handline construction on the most threatened flank (left), with Lopez squad starting in on the right flank upon their arrival (30-45 minutes later). \n\n**Communications:**\n\n* Good communication between SJC Dispatch, *Command*, WA DNR.\n* WA State Parks offered support if/where needed.\n* Some communication challenges were noted between *Command* and *Fireboat 31*, with multiple attempts for contact at times; needing to know who the squad leader was.\n* *Command* requested resource needs from *Operations*, and also developed a plan for extended attack (overnight) logistical needs.\n* Ensure a solid communication link between *Operations* and incoming resources, in this case *Boat 3/Lopez squad* on Tac 3 to vector them in for landing spot and initiate briefing\n\n**Other :**\n\n* *Command* had *Fireboat 31* complete a *360* of the island for full view of the incident\n* *Operations*, *Command*, and *Fireboat 31* communicated re a water use plan (hose, pump, etc.)\n* Area of origin was identified, flagged, and Command advised\n* No major issues with equipment, personnel readiness, and deployment\n* All responders in PFDs on boats, good squad integrity\n* Work on shorter/more concise squad briefings - *Plan, LCES, Specific Hazards/Logistic needs (developing equipment cache, etc.)* \n* Challenging for some participants to envision fire without smoke, flagging, etc.\n* Lookout for each division was established, with weather observations given for incident every 30 minutes\n* Three participants were able to practice their leadership skills (*Operations*, *Division Alpha* and *Division Bravo*) for *FF1/ICT5* task books\n\nExercise was terminated once the two squads connected left and right flank ‘handlines’; an after action review (AAR) was done on site with all squad members prior to their departure on *Fireboat 31* and *Boat 3*.\n\nOnce again, thanks to all involved (especially *Fireboat 31* and *Boat 3* crew). \n\nJordan Pollack, Division Chief\n\nSan Juan Island Fire-Rescue\n\nCoordinator, San Juan County Interagency Wildland Team",
  "featured_image": {
    "source": "img_3143.jpg"
  }
}