{
  "post_type": "Announcement",
  "date": "2025-08-27T15:14",
  "title": "Public Notice: Request for Proposal",
  "lede": "S﻿tuart Island Fire Station Professional Serviced Bid Solicitation",
  "body": "\n\n# Public Notice: Request for Proposal – Architectural and Engineering Services\n\nPursuant to RCW 39.80 San Juan County Fire Protection District No. 3 is soliciting proposals from qualified architectural and engineering firms for the “shovel ready” design of a new fire station located on Stuart Island, WA.\n\n## Project Overview\n\nThe proposed facility will qualify as an Owner Builder project under County code with a total square footage not to exceed 999 sq ft including:\n\n\\- Two garage doors specified for apparatus access\\\n\n* Poured slab concrete floor\\\n* One entry door\\\n* Propane radiant thermostatic heater and propane storage tank\\\n* Single-pitch metal roof\n\n\\- Rainwater catchment\n\n\\-5,000 gallon catchment tank on pedestal\n\n\\- Water tank plumbed to valved 2.5” NH and accessible to fire truck refill\n\n\\- Water tank privacy screened to road frontage\\\n\n* Insulated and finished interior\\\n* Windows for natural light\\\n* Electrical system with GFI outlets and lighting fixtures\\\n* Electrical service fixed propane generator\\\n* Exterior finish to match or blend with existing structures on the property\\\n* Perimeter drain rock, stormwater mitigation as required\n\n\\- Outdoor covered meeting and rest area\n\n## Site Description\n\nThe project site is located on Stuart Island, a remote-access location within San Juan County, Washington. The property is owned and operated by San Juan County School District No. 149 and is made available to the Fire District under an existing License Agreement. All design and construction plans must be reviewed and approved by the School District. Building site faces road frontage, locating may require conditional use variance from County.\n\n## Scope of Services\n\nThe selected firm will provide full architectural and engineering services including:\n\n\\- Site evaluation and specification\\\n\n* Groundwork and grading plans\\\n* Conceptual and schematic design for initial approval by Fire District Board and final approval by School Board\n\n\\- Design development and construction documents\\\n- Permitting support\\\n- Construction administration (optional)\\\n- Compliance with current San Juan County Washington State Building Codes\n\n## Submission Instructions\n\nAll proposals must be received no later than September 30, 2025. Electronic submissions are not accepted. Late submissions will not be considered.\n\nSubmit proposals to:\\\nATTN: Fire Chief Noel Monin RE: STUART ISLAND\\\nSan Juan County Fire Protection District No. 3\\\n1011 Mullis Street\\\nFriday Harbor, WA 98250\n\n## Contact Information\n\nFor questions or to arrange a site visit, please contact the Fire District office. 360-378-5334"
}