{
  "post_type": "Announcement",
  "date": "2025-09-05T13:26",
  "body": "Tom’s journey began in 1988 with San Juan Fire & Rescue, where he quickly became known for his calm presence, technical skill, and steadfast commitment to public safety. Over the decades, he served in numerous roles across multiple agencies, including as a 911 Dispatcher, EMT, and firefighter. He retired from a full career in dispatching in 2022, having been a vital voice on the other end of the line during countless emergencies.\n\nThroughout his career, Tom held many distinguished positions, including Interim Fire Chief of the Friday Harbor Fire Department and Safety Officer for San Juan Fire & Rescue. His leadership, mentorship, and institutional knowledge have been invaluable to the department and the broader emergency services community.\n\nIn 2023, Tom was honored with the department’s perpetual “Firefighter of the Year” award, a testament to his enduring impact and the respect he has earned from his peers. With this retirement, he will also be inducted into the San Juan Island Fire Department Hall of Fame, a well-deserved recognition of his lifetime of service.\n\nBeyond the uniform, Tom is known for his love of fire trucks, his early passion for weightlifting, his adventures as a private pilot, and his unique hobby of collecting miniatures. These interests reflect the same curiosity and dedication he brought to his professional life.\n\nAs he steps into retirement, Tom has been invited to return in a new capacity—as the department’s official photographer—should he choose to continue sharing his talents with the community.\n\nLieutenant Eades, your legacy will live on in the lives you’ve touched, the colleagues you’ve inspired, and the community you’ve protected. We thank you for your service, and we wish you all the best in this next chapter.\n\nWith deepest gratitude,\n\nYour San Juan Island Fire & Rescue Family",
  "title": "Honoring the Retirement of Lieutenant Tom Eades: A Legacy of Service, Dedication, and Heart",
  "lede": "After more than 37 years of unwavering service to the San Juan Island community, Lieutenant Tom Eades is retiring from San Juan Island Fire & Rescue, leaving behind a legacy defined by dedication, compassion, and a deep passion for emergency response.",
  "featured_image": {
    "source": "press-release-tomeadesretirement.png"
  }
}