{
  "post_type": "Department Highlight",
  "date": "2025-07-24T00:00",
  "title": "Community Report - Part 1 of 2: A Department Transformed",
  "lede": "The conclusion was clear: The department's mission was not sustainable without significant change. And so, change began.",
  "featured_image": {
    "source": "493322317_1346995206822589_8067546107372654811_n.jpg"
  },
  "body": "# *San Juan Island Fire & Rescue: Community Report Part 1 of 2: A Department Transformed*\n\n***Mission Statement***\n\n*“Preserving life, protecting property, and safeguarding our community through unwavering commitment to emergency response and community risk reduction.”*\n\n## A Legacy of Service\n\nSan Juan Island Fire & Rescue (SJIF&R) was established in 1958 under RCW Chapter 52 as a volunteer fire department. Today, it operates as a combination of paid staff and volunteers, proudly serving nine islands: San Juan, Brown, Dinner, Henry, Pearl, Johns, Stuart, Speiden, and O’Neil. The Town of Friday Harbor, located on San Juan Island, is the only incorporated town, serves as the county seat and was annexed into Fire District 3 by the voters.\n\nThe unique geography and seasonal population swings of our islands demand a wide range of fire and rescue capabilities. From remote wilderness to urban neighborhoods, SJIF&R is equipped to respond with professionalism and care.\n\n## A Time of Change\n\nBetween October 2023 and February 2024, SJIF&R underwent a major leadership transition. The voters elected a new majority of Fire Commissioners. The Commission immediately appointed a new chair and co-chair, along with selecting a new Fire Chief. This leadership team urgently launched a comprehensive review of staffing, operations, and budgeting.\n\nThe conclusion was clear: ***The department’s mission was not sustainable without significant change. And so, change began.***\n\n## 18 Months of Progress: A Baker’s Dozen of Milestones\n\nSJIF&R has transformed over the past 18 months through leadership changes, community collaboration, and operational improvements. Major highlights include:\n\n**1. Volunteer Staffing and Station Growth**\n\n* January 2024: 10 full-time employees (FTE), 33 volunteers, 8 stations/caches\n* June 2025: 8.25 FTE, 56 volunteers, 11 stations/caches\n\n**2. Successful Levy Lid-Lift**\n\n* A fact-based campaign led to voter approval of a funding increase aligned to maintain services for the next 20 years, effective April 15, 2025.\n\n**3. Secured Over $150,000 value in Grants and Equipment Deals**\n\n* Funding supported communications upgrades, protective gear, fleet expansion, and community risk reduction programs.\n\n**4. Improved Financial Oversight**\n\n* Administrative directives, austerity measures, and internal controls are saving the department hundreds of thousands in soft costs, annually.\n\n**5﻿. Small Business Fire Safety Program**\n\n* In partnership with the Town of Friday Harbor, SJIF&R now provides annual on-site fire & life safety inspections for local businesses.\n\n**6. Improved Volunteer Recruitment and Training**\n\n* 18 new, lateral, or returning certified volunteer firefighters have joined the ranks.\n\n**7. Enhanced Marine Response**\n\n* In collaboration with the Port of Friday Harbor, the department repositioned its fireboat and emergency cache for a faster response.\n\n**8. Wildland Fire Management**\n\n* Partnered with the Land Bank, DNR, and Conservation District to manage the island’s first “let-it-burn” wildland fire following a lightning strike.\n\n**9. Maintained WSRB Rating of 6**\n\n* This rating helps keep insurance costs manageable for residents.\n\n**10. Outer Island Brigade Program**\n\n* Novel first responder recruit training and credentialing program established on Stuart Island and Johns Island, including fire stations and fire trucks.\n\n**11. Enhanced Community Risk Reduction**\n\n* Partnered with Washington State Wildfire Ready Neighbors and Ambassador’s programs to provide individual home assessments and assistance leading to increased neighborhood wildfire resiliency.\n\n**12. Focus on internal risk management**\n\n* Updating and officiating agency policy and procedure manuals.\n\n**1﻿3. Response Readiness Prioritized**\n\n* Repaired staffing model expected to provide minimum career staffing of one chief officer, one company officer, and one company engineer, “24/7/365” – alongside a well-trained and dedicated standing army of volunteers.\n\nStay tuned for Part 2 in next week’s edition, where we’ll explore the department’s strategic vision for the next five years, the values guiding its future, and the challenges ahead.\n\nFor more information or to get involved, contact SJI Fire & Rescue!"
}