{
  "post_type": "News",
  "date": "2025-09-08T00:00",
  "title": "Community Report - Part 2 of 2: Looking Ahead — A Strategic Vision for the Future",
  "lede": "In Part 1, we shared how San Juan Island Fire & Rescue (SJIF&R) has transformed over the past 18 months through leadership changes, community collaboration, and operational improvements. Now, we turn our focus to the future — and how the department is planning to meet the evolving needs of our island communities.",
  "body": "## Building the Next Five Years: A Strategic Plan in Progress\n\nSJIF&R is currently developing a new 5-Year Strategic Plan. This Plan will guide the department’s priorities, investments, and community engagement through 2030. Once a draft is complete, the public and our first responder partners will be invited to review and provide feedback.\\\n\\\nThe Plan is being shaped around three core values that define who we are and how we serve:\n\n### Character\n\nOur staff and volunteers are at the heart of the department. Their integrity, dedication, and professionalism are essential to our mission. We are committed to fostering a culture where every team member is respected, supported, and empowered to proudly serve within a merit-based organization.\n\n### Camaraderie\n\nWe believe in the power of partnership — both within our department and with the broader community. Open communication, mutual respect, and shared goals strengthen our ability to respond effectively and build resilience together.\n\n### Community\n\nWe are stewards of public safety. That means earning and maintaining the trust of the people we serve. Every decision we make is guided foremost by our responsibility to protect lives, property, and the unique character of our island communities.\n\nPlanning for Challenges Ahead\n\n* Maintaining and Improving Insurance Rating: Facilities, fleet, equipment, and firefighter staff all combined deliver certain performance measures that keep fire insurance attainable for you – the District remains diligent in finding ways to maintain or improve your access to insurance.\n* Volunteer Sustainability: As nationwide volunteerism trends have waned, we must continue to recruit, train, equip, and retain these dedicated and selfless individuals – economy of scale requires that the District fosters a successful volunteer firefighting contingent.\n* Prepared for changes: Changing weather patterns, increased populations, and urban densification collectively increase complexity of emergencies - the District proactively approaches its capabilities, capacities, and services to meet the needs of today and tomorrow.\n* Fiscal Responsibility: Even with new funding, careful stewardship of public resources for our essential services remains a top priority – the reserve fund will be key to ensuring sustained operations for up to one year, regardless of socio-economic climate.\n* Succession Success: Experienced and key role staff are ever wary of their last day on the job and strive to share all the knowledge and experience they have with all members of the team.\n\n## A Call to the Community\n\nAs we strive to maintain readiness to serve when the call comes, we also call upon you - our neighbors, business owners, and civic partners — to stay engaged in your own preparedness and safety:\n\n* Keep your home safe – alarm systems maintained, chimney cleaned/inspected, rooms and hallways accessible, emergency egresses cleared, staircases clear of clutter, fire extinguisher handy, decks in good shape, driveway accessible for emergency services, exterior is fire hardened, yard is fire wise.\n* Carry a civil attitude – drive safely and courteously, act according to the outdoor fire danger rating, help your neighbors who need it, demonstrate safety through your actions, safely extinguish cigarettes.\n* Be prepared (www.islandsready.com) – have an emergency plan and practice it, have potable water and non-perishable food stored, know where your gas and water line shutoffs are, be wise during major events.\n\nTogether, we can ensure that San Juan Island Fire & Rescue remains strong, responsive, and ready — today and for generations to come.\n\nYour input, support, and participation are vital to the continued success of SJIF&R. Whether you’re interested in volunteering, attending a public meeting, or simply learning more about fire safety, we welcome your involvement.\n\nFor more information or to get involved, contact SJIF&R through [www.sjifire.org](http://www.sjifire.org) or [www.facebook.com/SJIFire](http://www.facebook.com/SJIFire).\n\nRespectfully submitted by the San Juan Island Fire Commission:\n\nMembers Dwight Colley, Warren Appleton and Alexa Rust.\n\n \n\n*For Release: August 1, 2025*\n\n*Press Release Contact Information:*\n\n*Chief Noel Monin*"
}